Operações

In [2]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

"unique" seleção de dados unicos de uma coluna especifica

Metodo parão pandas

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
import numpy as np

Metodo unique do numpy

In [6]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

Forma de saber a quantidade de valores unicos na coluna

In [9]:
len(df['col2'].unique())

3

Metodo do pandas para saber quantidade de valores unicos na coluna

In [10]:
df['col2'].nunique()

3

Metodo que mostra os valores unicos e a quantidade que se repete

In [12]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

Forma de saber o valor x > y no caso > 2, gerando um subconjunto que atende a minha condição

In [13]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

Usar Simbolo no caso "&" e não o and

In [14]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

DEfino uma função

In [19]:
def vezes2(x):
    return x*2

In [16]:
df.sum()

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [17]:
df['col1'].sum()

10

forma de aplicar as funções que você define

In [20]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

EM vez de definir função defina um lambda e não necessito de usar função

In [23]:
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [24]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Forma de deletar coluna

In [25]:
del df['col2']

In [26]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

Qual o nomes das colunas ou numeros

In [27]:
df.columns

Index(['col1', 'col3'], dtype='object')

Qual o indices podendo ser nome ou numero

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

ordenar meu DataFreme

In [37]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Usar "inplace=True" para aplciar alteração no DataFrame original

In [38]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Por padrão o metodo tem "inplace=False"

In [39]:
df.sort_values(by='col2', inplace=True )

In [40]:
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

Mostra os valores null

In [41]:
df.isnull()

    col1   col2   col3
0  False  False  False
3  False  False  False
1  False  False  False
2  False  False  False

Metodo que que exclui valores null

In [42]:
df.dropna()

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [43]:
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [44]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

Metodo prenche os valores NaN, no caso prenche com mdeia

Para aplicar necessario "inplace=True"

In [45]:
df['col1'].fillna(value=df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [46]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [49]:
data ={'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [50]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

Metodo que reordena os dados para que faça sentido para o usuario

In [52]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN